MaroueneKaaniche/STM32-Touch-screen-robot-control/STM32 touch screen robot control/Core/Src/main.c
    /* Send the command */
    HAL_SDRAM_SendCommand(&hsdram1, &Command, SDRAM_TIMEOUT);

    /* Step 6: Set the refresh rate counter */
    /* Set the device refresh rate */
    HAL_SDRAM_ProgramRefreshRate(&hsdram1, REFRESH_COUNT);

    //Deactivate speculative/cache access to first FMC Bank to save FMC bandwidth
    FMC_Bank1->BTCR[0] = 0x000030D2;
  /* USER CODE END FMC_Init 2 */
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOJ_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOK_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOI_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_Port, LCD_BL_CTRL_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LCD_DISP_GPIO_Port, LCD_DISP_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin : LCD_BL_CTRL_Pin */
  GPIO_InitStruct.Pin = LCD_BL_CTRL_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_DISP_Pin */
  GPIO_InitStruct.Pin = LCD_DISP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_DISP_GPIO_Port, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(100);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartUartTask */
/**
* @brief Function implementing the UartTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartUartTask */
void StartUartTask(void *argument)
{
  /* USER CODE BEGIN StartUartTask */
  /* Infinite loop */
  for(;;)
{
	if(TuningRK==1)
		{
		if(sendE==1)
			{
			sprintf(msg,"EncoderSpacing:RK=%lux",val);
			HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
			sendE=0;
			PreReceiveE=1;
			}
		else if(sendS==1)
			{
			sprintf(msg,"WheelSpacing:RK=%lux",val);
			HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
			sendS=0;
			PreReceiveS=1;
			}

		else if(sendRW==1)
		{
			sprintf(msg,"RightRadius:RK=%lux",val);
			HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
			sendRW=0;
			PreReceiveRW=1;
		}
		else if(sendLW==1)
		{
			sprintf(msg,"LeftRadius:RK=%lux",val);
			HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
			sendLW=0;
			PreReceiveLW=1;
		}
	}
	else if(TuningRS==1)
	{
		if(sendE==1)
			{
			sprintf(msg,"EncoderSpacing:RS=%lux",val);
			HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
			sendE=0;
			PreReceiveE=1;
			}
		else if(sendS==1)
			{
			sprintf(msg,"WheelSpacing:RS=%lux",val);
			HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
			sendS=0;
			PreReceiveS=1;
			}

		else if(sendRW==1)
		{
			sprintf(msg,"RightRadius:RS=%lux",val);
			HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
			sendRW=0;
			PreReceiveRW=1;
		}
		else if(sendLW==1)
		{
			sprintf(msg,"LeftRadius:RS=%lux",val);
			HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
			sendLW=0;
			PreReceiveLW=1;
			}
		}
	else if(sendSide==1){
		if (Side==1)
			sprintf(msg,"Yellow:x");
		else if (Side==2)
			sprintf(msg,"Violet:x");
		HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
		sendSide=0;
		Side=0;
		}
	else if(sendStrategy==1){
		sprintf(msg,"Strategy:%ux",Strategy);
		HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
		sendStrategy=0;
		Strategy=0;
		}
	else if(TestingRK==1)
		{
			if(sendXY==1){
				sprintf(msg,"Go:RK:X=%uY=%ux",X,Y);
				HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
				sendXY=0;
			}
			else if(sendRotate==1){
				sprintf(msg,"Rotate:RK:%ux",N);
				HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
				sendRotate=0;
			}
		}
	else if(TestingRS==1)
		{
			if(sendXY==1){
				sprintf(msg,"Go:RS:X=%uY=%ux",X,Y);
				HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
				sendXY=0;
			}
			else if(sendRotate==1){
				sprintf(msg,"Rotate:RS:%ux",N);
				HAL_UART_Transmit(&huart1, msg, sizeof(msg), 100);
				sendRotate=0;
			}
		}
	  osDelay(20);
  }

  /* USER CODE END StartUartTask */
}

/* USER CODE BEGIN Header_TaskUARTListen */
/**
* @brief Function implementing the taskUARTListe thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_TaskUARTListen */
void TaskUARTListen(void *argument)
{
  /* USER CODE BEGIN TaskUARTListen */
  /* Infinite loop */
  for(;;)
  {
	HAL_UART_Receive_IT(&huart1, msg1,sizeof(msg1) );
//	HAL_UART_Receive(&huart1, msg1, sizeof(msg1),100);
	if(TuningRK==1){
		if(receiveE==1){
			  	a1=atoi(&msg1[0]);
			  	receiveE=0;
			  	PreReceiveE=0;
			  	for(i=0;i<8;i++){
			  		msg1[i]=0;
			  		}
			  	}
			if(receiveS==1){
				b1=atoi(&msg1[0]);
				receiveS=0;
				PreReceiveS=0;
					for(i=0;i<8;i++){
						msg1[i]=0;
					  }
			  }
			if(receiveRW==1){
				c1=atoi(&msg1[0]);
				receiveRW=0;
				PreReceiveRW=0;
					for(i=0;i<8;i++){
						msg1[i]=0;
					}
			  	}
			if(receiveLW==1)
			{
				TuningRK=0;
				d1=atoi(&msg1[0]);
				receiveLW=0;
				PreReceiveLW=0;
					for(i=0;i<8;i++){
						msg1[i]=0;
					}
				if (first_time_launch==1)
				{
					TuningRS=1;
					TuningRK=0;
				}
			}


	}
	if(TuningRS==1){

		if (first_time_launch==1)
		{
			first_time_launch=2;
			PreReceiveLW=1;
			PreReceiveRW=1;
			PreReceiveE=1;
			PreReceiveS=1;
		}

		if(receiveE==1){
			  	a=atoi(&msg1[0]);
			  	receiveE=0;
			  	PreReceiveE=0;
			  	for(i=0;i<8;i++){
			  		msg1[i]=0;
			  		}
			  	}
		if(receiveS==1)
		{
			b=atoi(&msg1[0]);
			receiveS=0;
			PreReceiveS=0;
				for(i=0;i<8;i++)
				{
					msg1[i]=0;
				}
		}
		if(receiveRW==1)
		{
			c=atoi(&msg1[0]);
			receiveRW=0;
			PreReceiveRW=0;
				for(i=0;i<8;i++)
				{
					msg1[i]=0;
				}
		}

